nguyen220999/Flash-bootloader-STM32F1/MCAL/arm_cm3/drivers/STM32F10x_StdPeriph_Driver/src/stm32f10x_flash_swil.c
  /* Check for the Flash Status */
  status = FLASH_GetBank1Status();
  /* Wait for a Flash operation to complete or a TIMEOUT to occur */
  while((status == FLASH_FLAG_BANK1_BSY) && (Timeout != 0x00))
  {
    status = FLASH_GetBank1Status();
    Timeout--;
  }
  if(Timeout == 0x00 )
  {
    status = FLASH_TIMEOUT;
  }
  /* Return the operation status */
  return status;
}

#ifdef STM32F10X_XL
/**
  * @brief  Waits for a Flash operation on Bank2 to complete or a TIMEOUT to occur.
  * @note   This function can be used only for STM32F10x_XL density devices.
  * @param  Timeout: FLASH programming Timeout
  * @retval FLASH Status: The returned value can be: FLASH_ERROR_PG,
  *         FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_WaitForLastBank2Operation(uint32_t Timeout)
{ 
  FLASH_Status status = FLASH_COMPLETE;
   
  /* Check for the Flash Status */
  status = FLASH_GetBank2Status();
  /* Wait for a Flash operation to complete or a TIMEOUT to occur */
  while((status == (FLASH_FLAG_BANK2_BSY & 0x7FFFFFFF)) && (Timeout != 0x00))
  {
    status = FLASH_GetBank2Status();
    Timeout--;
  }
  if(Timeout == 0x00 )
  {
    status = FLASH_TIMEOUT;
  }
  /* Return the operation status */
  return status;
}
#endif /* STM32F10X_XL */

/**
  * @}
  */
 __attribute__((section(".isr_vector")))
uint32_t internalTable[] =
{
   (uint32_t)&FLASH_SetLatency
  ,(uint32_t)&FLASH_HalfCycleAccessCmd
  ,(uint32_t)&FLASH_PrefetchBufferCmd
  ,(uint32_t)&FLASH_Unlock
  ,(uint32_t)&FLASH_Lock
  ,(uint32_t)&FLASH_ErasePage
  ,(uint32_t)&FLASH_EraseAllPages
  ,(uint32_t)&FLASH_EraseOptionBytes
  ,(uint32_t)&FLASH_ProgramWord
  ,(uint32_t)&FLASH_ProgramHalfWord
  ,(uint32_t)&FLASH_ProgramOptionByteData
  ,(uint32_t)&FLASH_EnableWriteProtection
  ,(uint32_t)&FLASH_ReadOutProtection
  ,(uint32_t)&FLASH_UserOptionByteConfig
  ,(uint32_t)&FLASH_GetUserOptionByte
  ,(uint32_t)&FLASH_GetWriteProtectionOptionByte
  ,(uint32_t)&FLASH_GetReadOutProtectionStatus
  ,(uint32_t)&FLASH_GetPrefetchBufferStatus
  ,(uint32_t)&FLASH_ITConfig
  ,(uint32_t)&FLASH_GetFlagStatus
  ,(uint32_t)&FLASH_ClearFlag
  ,(uint32_t)&FLASH_GetStatus
  ,(uint32_t)&FLASH_WaitForLastOperation
  
  ,(uint32_t)&FLASH_UnlockBank1
  ,(uint32_t)&FLASH_LockBank1
  ,(uint32_t)&FLASH_EraseAllBank1Pages
  ,(uint32_t)&FLASH_GetBank1Status
  ,(uint32_t)&FLASH_WaitForLastBank1Operation
};
/**
  * @}
  */

/**
  * @}
  */

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
